Repository: jbrathz/jPlugin-Search-and-OCR
Catalog: languages/jsearch-*.po
Languages: th_th

source: PDF Search
th_th: ค้นหา PDF

source: Dashboard
th_th: แดชบอร์ด

source: Manual OCR
th_th: OCR ด้วยตนเอง

source: Manage Folders
th_th: จัดการโฟลเดอร์

source: Settings
th_th: ตั้งค่า

source: REST API Debug
th_th: ดีบัก REST API

source: PDF Search Dashboard
th_th: แดชบอร์ด ค้นหา PDF

source: Total PDFs
th_th: จำนวน PDF ทั้งหมด

source: Linked to Posts
th_th: เชื่อมโยงกับโพสต์

source: Unlinked
th_th: ยังไม่เชื่อมโยง

source: Last Updated
th_th: อัปเดตล่าสุด

source: All Folders
th_th: ทุกโฟลเดอร์

source: Search PDFs...
th_th: ค้นหา PDF...

source: Search
th_th: ค้นหา

source: Clear
th_th: ล้าง

source: ID
th_th: ไอดี

source: PDF Title
th_th: ชื่อ PDF

source: Folder
th_th: โฟลเดอร์

source: Post Title
th_th: ชื่อโพสต์

source: OCR Method
th_th: วิธี OCR

source: Characters
th_th: จำนวนตัวอักษร

source: Actions
th_th: การดำเนินการ

source: View
th_th: ดู

source: Delete
th_th: ลบ

source: No PDFs found.
th_th: ไม่พบ PDF

source: Run OCR
th_th: เริ่ม OCR

source: No post linked
th_th: ยังไม่เชื่อมโยงกับโพสต์

source: Edit Post
th_th: แก้ไขโพสต์

source: Are you sure you want to delete
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบ

source: PDF deleted successfully.
th_th: ลบ PDF สำเร็จแล้ว

source: %s items
th_th: %s รายการ

source: Manually trigger OCR processing for individual files or entire folders.
th_th: เริ่มกระบวนการ OCR ด้วยตนเองสำหรับไฟล์เดี่ยวหรือทั้งโฟลเดอร์

source: Single File
th_th: ไฟล์เดี่ยว

source: Entire Folder
th_th: ทั้งโฟลเดอร์

source: Incremental (New Only)
th_th: เพิ่มเติม (เฉพาะไฟล์ใหม่)

source: Select Folder
th_th: เลือกโฟลเดอร์

source: -- Select Folder --
th_th: -- เลือกโฟลเดอร์ --

source: Optional: Select folder to categorize this PDF
th_th: ไม่บังคับ: เลือกโฟลเดอร์เพื่อจัดหมวดหมู่ PDF นี้

source: Google Drive File ID
th_th: ไอดีไฟล์ Google Drive

source: Example: 1abc123xyz456 (from drive.google.com/file/d/1abc123xyz456)
th_th: ตัวอย่าง: 1abc123xyz456 (จาก drive.google.com/file/d/1abc123xyz456)

source: Run OCR on File
th_th: เริ่ม OCR ไฟล์

source: Select the folder to OCR
th_th: เลือกโฟลเดอร์ที่ต้องการ OCR

source: Warning:
th_th: คำเตือน:

source: This will process ALL PDF files in the folder. This may take a long time depending on the number of files.
th_th: จะประมวลผลไฟล์ PDF ทั้งหมดในโฟลเดอร์ อาจใช้เวลานานขึ้นอยู่กับจำนวนไฟล์

source: Run OCR on Folder
th_th: เริ่ม OCR โฟลเดอร์

source: Select the folder to scan for new PDFs
th_th: เลือกโฟลเดอร์เพื่อสแกนหาไฟล์ PDF ใหม่

source: Info:
th_th: ข้อมูล:

source: This will only process NEW files that are not already in the database. Already processed files will be skipped.
th_th: จะประมวลผลเฉพาะไฟล์ใหม่ที่ยังไม่อยู่ในฐานข้อมูล ไฟล์ที่ประมวลผลแล้วจะถูกข้าม

source: Run Incremental OCR
th_th: เริ่ม OCR แบบเพิ่มเติม

source: Current Status
th_th: สถานะปัจจุบัน

source: Total PDFs in Database
th_th: จำนวน PDF ในฐานข้อมูล

source: PDFs with Posts
th_th: PDF ที่เชื่อมโยงกับโพสต์

source: PDFs without Posts
th_th: PDF ที่ยังไม่เชื่อมโยงกับโพสต์

source: How to Use
th_th: วิธีการใช้งาน

source: Use when you want to OCR one specific PDF. Get the file ID from the Google Drive URL.
th_th: ใช้เมื่อต้องการ OCR ไฟล์ PDF เฉพาะไฟล์ ดึงไอดีไฟล์จาก URL ของ Google Drive

source: Use for initial setup or when you want to reprocess all PDFs in a folder.
th_th: ใช้สำหรับการตั้งค่าครั้งแรกหรือเมื่อต้องการประมวลผล PDF ทั้งหมดในโฟลเดอร์ใหม่

source: Use regularly to process only new PDFs that were added since last run.
th_th: ใช้เป็นประจำเพื่อประมวลผลเฉพาะ PDF ใหม่ที่เพิ่มเข้ามาหลังจากรันครั้งล่าสุด

source: Tips
th_th: เคล็ดลับ

source: Make sure your Python OCR API is running at the configured URL
th_th: ตรวจสอบให้แน่ใจว่า Python OCR API กำลังทำงานที่ URL ที่ตั้งค่าไว้

source: Test the connection in Settings → API → Test Connection
th_th: ทดสอบการเชื่อมต่อที่ ตั้งค่า → API → ทดสอบการเชื่อมต่อ

source: For large folders, consider using Incremental mode to avoid timeouts
th_th: สำหรับโฟลเดอร์ขนาดใหญ่ แนะนำให้ใช้โหมดเพิ่มเติมเพื่อหลีกเลี่ยง timeout

source: Enable Auto-OCR in Settings → Automation to automatically process PDFs when saving posts
th_th: เปิดใช้งาน Auto-OCR ที่ ตั้งค่า → อัตโนมัติ เพื่อประมวลผล PDF อัตโนมัติเมื่อบันทึกโพสต์

source: Please enter a file ID.
th_th: กรุณากรอกไอดีไฟล์

source: Please select a folder.
th_th: กรุณาเลือกโฟลเดอร์

source: OCR failed:
th_th: OCR ล้มเหลว:

source: OCR completed successfully!
th_th: OCR เสร็จสมบูรณ์แล้ว!

source: Result:
th_th: ผลลัพธ์:

source: File:
th_th: ไฟล์:

source: Method:
th_th: วิธีการ:

source: OCR completed but failed to save to database.
th_th: OCR เสร็จแล้วแต่บันทึกลงฐานข้อมูลไม่สำเร็จ

source: Processing folder... This may take several minutes.
th_th: กำลังประมวลผลโฟลเดอร์... อาจใช้เวลาหลายนาที

source: Folder OCR completed! Success: %d, Errors: %d
th_th: OCR โฟลเดอร์เสร็จสมบูรณ์! สำเร็จ: %d, ผิดพลาด: %d

source: Processing new files only...
th_th: กำลังประมวลผลเฉพาะไฟล์ใหม่...

source: Incremental OCR completed! New: %d, Skipped: %d, Errors: %d
th_th: OCR แบบเพิ่มเติมเสร็จสมบูรณ์! ใหม่: %d, ข้าม: %d, ผิดพลาด: %d

source: Processing...
th_th: กำลังประมวลผล...

source: Manage Google Drive Folders
th_th: จัดการโฟลเดอร์ Google Drive

source: Add New Folder
th_th: เพิ่มโฟลเดอร์ใหม่

source: Edit Folder
th_th: แก้ไขโฟลเดอร์

source: Folder Name
th_th: ชื่อโฟลเดอร์

source: Display name for this folder (e.g., "บทความวัคซีน")
th_th: ชื่อแสดงสำหรับโฟลเดอร์นี้ (เช่น "บทความวัคซีน")

source: Google Drive Folder ID
th_th: ไอดีโฟลเดอร์ Google Drive

source: Get from URL: drive.google.com/drive/folders/<strong>FOLDER_ID</strong>
th_th: ดึงจาก URL: drive.google.com/drive/folders/<strong>FOLDER_ID</strong>

source: Set as Default
th_th: ตั้งเป็นค่าเริ่มต้น

source: Use this folder as default for manual OCR
th_th: ใช้โฟลเดอร์นี้เป็นค่าเริ่มต้นสำหรับ OCR ด้วยตนเอง

source: Add Folder
th_th: เพิ่มโฟลเดอร์

source: Update Folder
th_th: อัปเดตโฟลเดอร์

source: Cancel
th_th: ยกเลิก

source: Existing Folders
th_th: โฟลเดอร์ที่มีอยู่

source: No folders added yet. Add your first Google Drive folder above.
th_th: ยังไม่มีโฟลเดอร์ เพิ่มโฟลเดอร์ Google Drive แรกของคุณด้านบน

source: PDFs
th_th: PDF

source: Default
th_th: ค่าเริ่มต้น

source: Edit
th_th: แก้ไข

source: Open in Drive
th_th: เปิดใน Drive

source: Please fill in all required fields.
th_th: กรุณากรอกข้อมูลที่จำเป็นทั้งหมด

source: This Folder ID already exists.
th_th: ไอดีโฟลเดอร์นี้มีอยู่แล้ว

source: Folder added successfully!
th_th: เพิ่มโฟลเดอร์สำเร็จแล้ว!

source: Failed to add folder.
th_th: เพิ่มโฟลเดอร์ไม่สำเร็จ

source: Folder updated successfully!
th_th: อัปเดตโฟลเดอร์สำเร็จแล้ว!

source: Failed to update folder.
th_th: อัปเดตโฟลเดอร์ไม่สำเร็จ

source: Folder deleted successfully!
th_th: ลบโฟลเดอร์สำเร็จแล้ว!

source: Failed to delete folder.
th_th: ลบโฟลเดอร์ไม่สำเร็จ

source: Are you sure you want to delete folder
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบโฟลเดอร์

source: Note: PDFs from this folder will NOT be deleted, only the folder reference.
th_th: หมายเหตุ: PDF จากโฟลเดอร์นี้จะไม่ถูกลบ จะลบเฉพาะการอ้างอิงโฟลเดอร์เท่านั้น

source: PDF Search Settings
th_th: ตั้งค่าค้นหา PDF

source: Display
th_th: การแสดงผล

source: Automation
th_th: อัตโนมัติ

source: Advanced
th_th: ขั้นสูง

source: Import/Export
th_th: นำเข้า/ส่งออก

source: Save Settings
th_th: บันทึกการตั้งค่า

source: Settings saved successfully.
th_th: บันทึกการตั้งค่าสำเร็จแล้ว

source: API URL
th_th: URL ของ API

source: Python OCR API endpoint (e.g., http://localhost:8000)
th_th: ปลายทาง Python OCR API (เช่น http://localhost:8000)

source: API authentication key
th_th: คีย์สำหรับยืนยันตัวตน API

source: Timeout (seconds)
th_th: หมดเวลา (วินาที)

source: Request timeout in seconds
th_th: เวลาหมดเวลาของคำขอในหน่วยวินาที

source: Test Connection
th_th: ทดสอบการเชื่อมต่อ

source: Connection successful!
th_th: เชื่อมต่อสำเร็จ!

source: Connection failed:
th_th: เชื่อมต่อไม่สำเร็จ:

source: OCR Language
th_th: ภาษา OCR

source: Tesseract language codes (e.g., tha+eng)
th_th: รหัสภาษา Tesseract (เช่น tha+eng สำหรับไทย+อังกฤษ)

source: Note:
th_th: หมายเหตุ:

source: Google Drive folders are now managed in the
th_th: โฟลเดอร์ Google Drive จัดการได้ที่

source: page.
th_th: แล้ว

source: Results Per Page
th_th: จำนวนผลลัพธ์ต่อหน้า

source: Popular Keywords
th_th: คำค้นยอดนิยม

source: Comma-separated list (e.g., วัคซีน, โภชนาการ, พัฒนาการ)
th_th: รายการคั่นด้วยจุลภาค (เช่น วัคซีน, โภชนาการ, พัฒนาการ)

source: Enable Autocomplete
th_th: เปิดใช้งานการเติมอัตโนมัติ

source: Cache Duration (seconds)
th_th: ระยะเวลาแคช (วินาที)

source: 0 to disable caching
th_th: 0 เพื่อปิดการใช้งานแคช

source: Show Thumbnails
th_th: แสดงภาพขนาดย่อ

source: Thumbnail Size
th_th: ขนาดภาพขนาดย่อ

source: Snippet Length
th_th: ความยาวตัวอย่างข้อความ

source: Number of characters to show in preview
th_th: จำนวนตัวอักษรที่จะแสดงในตัวอย่าง

source: Highlight Color
th_th: สีไฮไลท์

source: Date Format
th_th: รูปแบบวันที่

source: PHP date format (e.g., Y-m-d H:i:s)
th_th: รูปแบบวันที่ PHP (เช่น Y-m-d H:i:s)

source: Auto-OCR on Save
th_th: OCR อัตโนมัติเมื่อบันทึก

source: Automatically OCR PDFs when saving posts
th_th: ประมวลผล OCR อัตโนมัติเมื่อบันทึกโพสต์

source: Detect Google Drive URLs
th_th: ตรวจจับ URL ของ Google Drive

source: Detect PDF Attachments
th_th: ตรวจจับไฟล์ PDF ที่แนบมา

source: Async Processing
th_th: ประมวลผลแบบอะซิงโครนัส

source: Process OCR requests asynchronously
th_th: ประมวลผลคำขอ OCR แบบอะซิงโครนัส

source: Debug Mode
th_th: โหมดดีบัก

source: Enable detailed error logging
th_th: เปิดใช้งานการบันทึกข้อผิดพลาดแบบละเอียด

source: Public API Access
th_th: การเข้าถึง API สาธารณะ

source: Allow non-logged-in users to use REST API
th_th: อนุญาตให้ผู้ใช้ที่ไม่ได้เข้าสู่ระบบใช้ REST API

source: Rate Limit (requests/minute)
th_th: จำกัดอัตรา (คำขอ/นาที)

source: 0 to disable
th_th: 0 เพื่อปิดการใช้งาน

source: Log Retention (days)
th_th: เก็บบันทึก (วัน)

source: Export Settings
th_th: ส่งออกการตั้งค่า

source: Download your settings as a JSON file for backup or migration.
th_th: ดาวน์โหลดการตั้งค่าเป็นไฟล์ JSON เพื่อสำรองหรือย้ายข้อมูล

source: Import Settings
th_th: นำเข้าการตั้งค่า

source: Upload a previously exported JSON file to restore settings.
th_th: อัปโหลดไฟล์ JSON ที่ส่งออกก่อนหน้านี้เพื่อกู้คืนการตั้งค่า

source: Settings imported successfully.
th_th: นำเข้าการตั้งค่าสำเร็จแล้ว

source: Failed to import settings. Invalid JSON.
th_th: นำเข้าการตั้งค่าไม่สำเร็จ JSON ไม่ถูกต้อง

source: Reset Settings
th_th: รีเซ็ตการตั้งค่า

source: Warning: This will reset all settings to default values.
th_th: คำเตือน: การดำเนินการนี้จะรีเซ็ตการตั้งค่าทั้งหมดเป็นค่าเริ่มต้น

source: Reset to Default
th_th: รีเซ็ตเป็นค่าเริ่มต้น

source: Are you sure you want to reset all settings?
th_th: คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตการตั้งค่าทั้งหมด?

source: Search in PDF documents...
th_th: ค้นหาในเอกสาร PDF...

source: Popular:
th_th: ยอดนิยม:

source: Searching...
th_th: กำลังค้นหา...

source: No results found.
th_th: ไม่พบผลลัพธ์

source: An error occurred. Please try again.
th_th: เกิดข้อผิดพลาด กรุณาลองใหม่อีกครั้ง

source: Relevance Score
th_th: คะแนนความเกี่ยวข้อง
